blasiusFLow/flat_plate/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];//  meter/sec

internalField   uniform (1 0 0);

boundaryField
{
    zeroGradientWall
    {
 	type            zeroGradient;
    }

    plate
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
