blasiusFLow/flat_plate/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];// meter^2/sec^2(kinematic pressure)

internalField   uniform 0;

boundaryField
{
    zeroGradientWall
    {
        type            zeroGradient;
    }

    plate
    {
        type            zeroGradient;
    }
    inlet
    {
        type		zeroGradient; 
    }
   // rightSide
    //{
    //    type            zeroGradient;
   // }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
