blasiusFLow/flat_plate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    zeroGradientWall
    {
        type            patch;
        nFaces          280;
        startFace       17340;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       17620;
    }
    plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       17660;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          17600;
        startFace       17860;
    }
)

// ************************************************************************* //
